duxinglang-1/nRF52810_test/JPR/examples/ble_peripheral/ble_app_template/main.c
static bool              m_in_boot_mode = false; 


nrf_drv_wdt_channel_id m_channel_id;
static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */

static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */

// YOUR_JOB: Use UUIDs for service(s) used in your application.
static ble_uuid_t m_adv_uuids[] =                                               /**< Universally unique service identifiers. */
{
//    {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE},
		{BLE_UUID_NUS_SERVICE, BLE_UUID_TYPE_BLE}
};


static void advertising_start(bool erase_bonds);


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}



/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module.
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
		system_time_init();

    // Create timers.
 
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    /* YOUR_JOB: Use an appearance value matching the application's use case.
       err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
       APP_ERROR_CHECK(err_code); */

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling events from the GATT library. */
void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
    if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
    {
        m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
        NRF_LOG_INFO("Data len is set to 0x%X(%d)", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
    }
    NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x",
                  p_gatt->att_mtu_desired_central,
                  p_gatt->att_mtu_desired_periph);
}

/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);
	
	  err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}
//断开
void disconnect_app(void)
{
	sd_ble_gap_disconnect(m_conn_handle,BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
}
//进入升级模式
static void enter_dfu_mode(int8_t CMD)
{
	if( CMD == 0X01) //received the DFU command from master
	{
			
		uint32_t err_code = sd_power_gpregret_set(0, 0xB1); 

			 APP_ERROR_CHECK(err_code);
	 
			(void)sd_nvic_SystemReset();

	}
}
// 白名单响应
uint32_t whitelist_response(char pbuff[],uint16_t	cmd_id)
{
	uint8_t buff[10];
	uint16_t sendlength=0;
static	uint16_t error;
	memset(buff,0,sizeof(buff));
	
	memcpy(buff,pbuff,strlen(pbuff));
	
	if( cmd_id == 0xFF59)  
	{  
		buff[0]=0xAB ;
		buff[1]=0x00 ;
		buff[2]=0x05 ;
		
		buff[3]=0xFF ;
		buff[4]=0x59 ;
		
		buff[5]=0x80 ;
		buff[6]=0x00 ;
		for(uint8_t i=0;i<7;i++)
			buff[7]=buff[7]+buff[i] ;//crc
		
		buff[8]=0x88 ;
		sendlength = 9 ;
		error = ble_nus_data_send(&m_nus, buff, &sendlength, m_conn_handle);
		NRF_LOG_INFO("error:%x \r\n",error);

	}
}
//应答
void ack_find(bool is_find_flag)
{	
	uint8_t buff[10];
	uint16_t sendlength=0;
	static	uint16_t error;
	memset(buff,0,sizeof(buff));
	
		buff[0]=0xAB ;
		buff[1]=0x00 ;
		buff[2]=0x08 ;
		
		buff[3]=0xFF ;
		buff[4]=0x58 ;
		
		buff[5]=0x80 ;
		buff[6]=0x00 ;
		
		buff[7]=is_find_flag ;//
		
		for(uint8_t i=0;i<7;i++)
			buff[8]=buff[8]+buff[i] ;//crc
		  
		buff[9]=0x58 ;
		sendlength = 10;
		error = ble_nus_data_send(&m_nus, buff, &sendlength, m_conn_handle);
		NRF_LOG_INFO("error:%x \r\n",error);
		if(is_find_flag == false)
		{
			connect_flag  = true;	
			NRF_LOG_INFO(" XXXXXX not found \r\n");
		}			
}





/**@brief Function for handling the YYY Service events.
 * YOUR_JOB implement a service handler function depending on the event the service you are using can generate
 *
 * @details This function will be called for all YY Service events which are passed to
 *          the application.
 *
 * @param[in]   p_yy_service   YY Service structure.
 * @param[in]   p_evt          Event received from the YY Service.
 *
 */
static uint8_t	temp[40];
static uint8_t	buff[40];
uint8_t actual_length=0;
uint16_t command_id=0;
uint16_t	data_length=2;
uint32_t 	error;
static void nus_data_handler(ble_nus_evt_t * p_evt)
{
	  if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {  
				static uint32_t err_code;
		  	static uint16_t packet_len=0;
		  	static uint16_t data_len=0;				
				static uint8_t	crc=0;
				uint8_t	cmd_id_l=0;	//id的低8bit
				uint8_t	cmd_id_h=0; //id的高8bit
		
         
