duxinglang-1/nRF52810_test/JPR/examples/ble_peripheral/ble_app_template/main.c
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
			 	packet_len = p_evt->params.rx_data.length; //整个包长
				memset(buff,0, packet_len);	

				memcpy(buff,p_evt->params.rx_data.p_data,packet_len);
			
				NRF_LOG_INFO(" packet_len:%d\r\n",packet_len);
			
				if(	memcmp(buff,g_aes_out,RANDOM_BUFF_SIZE) == 0)//验证随机数
				{
						write_flag = true;
						NRF_LOG_INFO("  ******************** \r\n");
						NRF_LOG_INFO("   OK OK OK OK OK  \r\n");
				}	
				else if((buff[0] == 0xAB)&&(buff[p_evt->params.rx_data.length-1] != 0x88 ))
				{
					memcpy(temp,buff,packet_len);
				}
				else if((buff[0] != 0xAB)&&(buff[p_evt->params.rx_data.length-1]==0x88))
				{
					memcpy(temp+20,buff,packet_len);
					actual_length = packet_len+20;
					memset(buff,0,sizeof(buff));
					memcpy(buff,temp+20,actual_length);
					
					NRF_LOG_INFO(" actual_length:%d\r\n",actual_length);
					for(uint8_t i=0;i<actual_length;i++)
					{				
						 NRF_LOG_INFO(" buff[%d]:%x\r\n",i,buff[i]);
					}
				}
				else if((buff[0] == 0xAB)&&(buff[p_evt->params.rx_data.length-1]==0x88 ))
				{
					NRF_LOG_INFO(" packet_len:%d\r\n",p_evt->params.rx_data.length);
					actual_length = p_evt->params.rx_data.length;
					for(uint8_t i=0;i<actual_length;i++)
					{				
						 NRF_LOG_INFO(" buff[%d]:%x\r\n",i,buff[i]);
					}
				}
				else
				{
					disconnect_app(); //随机数验证，APP 加密后的结果不相等，断开feng
				} 
				NRF_LOG_INFO(" ++++++++++++++++++++++++ \r\n");
				//=============================
			
	#if 1	//if((buff[0] == 0xAB)&&(buff[actual_length-1] == 0x88 ))
				if((buff[0] == 0xAB)&&(buff[actual_length-1] == 0x88 )) // 
				{
					data_len = ((buff[1]<<8)|buff[2]) ;
					cmd_id_h=buff[3] ;
					cmd_id_l=buff[4] ;
					command_id = (cmd_id_h<<8|cmd_id_l) ;
					crc=0;
					
					for(int8_t i=0;i<packet_len -2;i++)
					{
						 crc =  crc + buff[i] ;
					}
						NRF_LOG_INFO(" crc  is ok \r\n");
					
					if(crc == buff[actual_length -2])//crc
					{
 
							if(command_id == 0xFF30)////升级指令
							{
								 enter_dfu_mode(0x01);
							}		
							if(command_id == 0xFF58)//find，APP发送手机的ID给BLE 手表
							{
								memset(test_buff,0,sizeof(test_buff));
								memcpy(test_buff,buff+7,data_len-6);
								find_whilt_flag = true;				
								judg_app_flag = true; 							
								guard_time_manger(false);								
								NRF_LOG_INFO(" Rec data comm:%4x,data_len:%d \n",command_id,data_len);
								NRF_LOG_INFO(" ++++++ 0xFF58 0xFF58 0xFF58 \n");
							}	
							//0x ab 00 07 ff 21 80 00 01 53 88
							if(command_id == 0xFF21)//苹果手机连接后，发送过来的,苹果先发这个，后发0xff58
							{  	
								ble_gap_sec_params_t params;

								params.bond = 0;
								params.mitm = 1;

								sd_ble_gap_authenticate(m_conn_handle, &params);				
								 

								NRF_LOG_INFO(" ++++++ 0xFF21 0xFF21 0xFF21 \n");	 
								NRF_LOG_INFO(" ++++++ 0xFF21 0xFF21 0xFF21 \n");
							}					

//shut down uart							
#if 1
							if((command_id != 0xFF30)&&(command_id != 0xFF58)&&(command_id != 0xFF21)&&(judg_app_flag == true))
							{
									for (uint32_t i = 0; i < actual_length; i++)
									{
											do
											{										
													err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);//to 9160
													NRF_LOG_INFO(" 1+++err_code:%d \r\n",err_code);
													if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
													{
															NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
															APP_ERROR_CHECK(err_code);
													}
											} while (err_code == NRF_ERROR_BUSY);
									}
										NRF_LOG_INFO(" Tx uart over!  ");
					  	}
#endif
							
//清零准备接收下一条							
						crc = 0 ; 
							memset(buff,0,sizeof(buff));
					}
			 }
		#endif //if((buff[0] == 0xAB)&&(buff[actual_length-1] == 0x88 ))
			 
 
		 
			
		}//
		
}
///=============================================================

/**@brief Function for handling Service errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void service_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling HID events.
 *
 * @details This function will be called for all HID events which are passed to the application.
 *
 * @param[in]   p_hids  HID service structure.
 * @param[in]   p_evt   Event received from the HID service.
 */
static void on_hids_evt(ble_hids_t * p_hids, ble_hids_evt_t * p_evt)
{
    switch (p_evt->evt_type)
    {
        case BLE_HIDS_EVT_BOOT_MODE_ENTERED:
            m_in_boot_mode = true;
            break;

        case BLE_HIDS_EVT_REPORT_MODE_ENTERED:
            m_in_boot_mode = false;
            break;

        case BLE_HIDS_EVT_REP_CHAR_WRITE:
            //on_hid_rep_char_write(p_evt);
            break;

        case BLE_HIDS_EVT_NOTIF_ENABLED:
            break;

        default:
            // No implementation needed.
            break;
    }
}

/**@brief Function for initializing HID Service.
 */
static void hids_init(void)
{
    ret_code_t                    err_code;
    ble_hids_init_t               hids_init_obj;
    ble_hids_inp_rep_init_t     * p_input_report;
    ble_hids_outp_rep_init_t    * p_output_report;
    ble_hids_feature_rep_init_t * p_feature_report;
    uint8_t                       hid_info_flags;

    static ble_hids_inp_rep_init_t     input_report_array[1];
    static ble_hids_outp_rep_init_t    output_report_array[1];
    static ble_hids_feature_rep_init_t feature_report_array[1];
    static uint8_t                     report_map_data[] =
    {
        0x05, 0x01,       // Usage Page (Generic Desktop)
        0x09, 0x06,       // Usage (Keyboard)
        0xA1, 0x01,       // Collection (Application)
        0x05, 0x07,       // Usage Page (Key Codes)
        0x19, 0xe0,       // Usage Minimum (224)
        0x29, 0xe7,       // Usage Maximum (231)
        0x15, 0x00,       // Logical Minimum (0)
        0x25, 0x01,       // Logical Maximum (1)
        0x75, 0x01,       // Report Size (1)
        0x95, 0x08,       // Report Count (8)
        0x81, 0x02,       // Input (Data, Variable, Absolute)

        0x95, 0x01,       // Report Count (1)
        0x75, 0x08,       // Report Size (8)
        0x81, 0x01,       // Input (Constant) reserved byte(1)

        0x95, 0x05,       // Report Count (5)
        0x75, 0x01,       // Report Size (1)
        0x05, 0x08,       // Usage Page (Page# for LEDs)
        0x19, 0x01,       // Usage Minimum (1)
        0x29, 0x05,       // Usage Maximum (5)
        0x91, 0x02,       // Output (Data, Variable, Absolute), Led report
        0x95, 0x01,       // Report Count (1)
        0x75, 0x03,       // Report Size (3)
        0x91, 0x01,       // Output (Data, Variable, Absolute), Led report padding

        0x95, 0x06,       // Report Count (6)
        0x75, 0x08,       // Report Size (8)
        0x15, 0x00,       // Logical Minimum (0)
        0x25, 0x65,       // Logical Maximum (101)
        0x05, 0x07,       // Usage Page (Key codes)
        0x19, 0x00,       // Usage Minimum (0)
        0x29, 0x65,       // Usage Maximum (101)
        0x81, 0x00,       // Input (Data, Array) Key array(6 bytes)

        0x09, 0x05,       // Usage (Vendor Defined)
        0x15, 0x00,       // Logical Minimum (0)
        0x26, 0xFF, 0x00, // Logical Maximum (255)
        0x75, 0x08,       // Report Size (8 bit)
        0x95, 0x02,       // Report Count (2)
        0xB1, 0x02,       // Feature (Data, Variable, Absolute)

        0xC0              // End Collection (Application)
    };

    memset((void *)input_report_array, 0, sizeof(ble_hids_inp_rep_init_t));
    memset((void *)output_report_array, 0, sizeof(ble_hids_outp_rep_init_t));
    memset((void *)feature_report_array, 0, sizeof(ble_hids_feature_rep_init_t));

    // Initialize HID Service
    p_input_report                      = &input_report_array[INPUT_REPORT_KEYS_INDEX];
    p_input_report->max_len             = INPUT_REPORT_KEYS_MAX_LEN;
    p_input_report->rep_ref.report_id   = INPUT_REP_REF_ID;
    p_input_report->rep_ref.report_type = BLE_HIDS_REP_TYPE_INPUT;

    p_input_report->sec.cccd_wr = SEC_JUST_WORKS;
    p_input_report->sec.wr      = SEC_JUST_WORKS;
    p_input_report->sec.rd      = SEC_JUST_WORKS;

    p_output_report                      = &output_report_array[OUTPUT_REPORT_INDEX];
    p_output_report->max_len             = OUTPUT_REPORT_MAX_LEN;
    p_output_report->rep_ref.report_id   = OUTPUT_REP_REF_ID;
    p_output_report->rep_ref.report_type = BLE_HIDS_REP_TYPE_OUTPUT;

    p_output_report->sec.wr = SEC_JUST_WORKS;
    p_output_report->sec.rd = SEC_JUST_WORKS;

    p_feature_report                      = &feature_report_array[FEATURE_REPORT_INDEX];
    p_feature_report->max_len             = FEATURE_REPORT_MAX_LEN;
    p_feature_report->rep_ref.report_id   = FEATURE_REP_REF_ID;
    p_feature_report->rep_ref.report_type = BLE_HIDS_REP_TYPE_FEATURE;

    p_feature_report->sec.rd              = SEC_JUST_WORKS;
    p_feature_report->sec.wr              = SEC_JUST_WORKS;

    hid_info_flags = HID_INFO_FLAG_REMOTE_WAKE_MSK | HID_INFO_FLAG_NORMALLY_CONNECTABLE_MSK;
		 
