duxinglang-1/nRF52810_test/JPR/examples/ble_peripheral/ble_app_template/main.c
}

ble_gap_enc_key_t  my_enc_key;
ble_gap_enc_key_t  my_enc_key_center;
ble_gap_sec_keyset_t keyset;
void init_keyset(void)
{
	//keyset.keys_periph.p_enc_key
	keyset.keys_peer.p_enc_key = &my_enc_key;
	keyset.keys_peer.p_id_key = NULL;
	keyset.keys_peer.p_sign_key = NULL;
	
	keyset.keys_own.p_enc_key = &my_enc_key_center ;
	keyset.keys_own.p_id_key = NULL;
	keyset.keys_own.p_sign_key = NULL;
}

//======================================================
/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void	app_connect(void)
{ 
static	uint8_t Push_conne[9];  
 
	uint32_t		error;
	
	memset(Push_conne,0,sizeof(Push_conne));
	Push_conne[0] = 0xAB; //AB
	Push_conne[1] = 0x00;
	Push_conne[2] = 0x06;//长度
	
	Push_conne[3] = 0xFF;//ID
	Push_conne[4] = 0xB0;	//ID
	
	Push_conne[5] = 0x80;//数据开始
	Push_conne[6] = 0x01;//数据结束
	
	Push_conne[7] = 0xE1;//校验和
	
	Push_conne[8] = 0x88; //
	
 
	for(uint8_t i=0;i<9;i++)
	{
		error = app_uart_put(Push_conne[i]);		
		NRF_LOG_INFO(" REC %d:%4x\r\n",i,Push_conne[i]);
	}
	
}
static void	app_disconnect(void)
{
	uint8_t Push_conne[9]; 
	
	memset(Push_conne,0,sizeof(Push_conne));
	Push_conne[0] = 0xAB;
	Push_conne[1] = 0x00;
	Push_conne[2] = 0x06;//长度
	
	Push_conne[3] = 0xFF;//ID
	Push_conne[4] = 0xB0;//ID
	
	Push_conne[5] = 0x80;
	Push_conne[6] = 0x00; //
	
	Push_conne[7] = 0xE0; //
	
	Push_conne[8] = 0x88;

	for(uint8_t i=0;i<9;i++)
	{
		app_uart_put(Push_conne[i]);		
		NRF_LOG_INFO("Connected %d:%4x\r\n",i,Push_conne[i]);
	}
	
}

/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.   

 */
uint8_t step_counter;
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t err_code = NRF_SUCCESS;

    switch (p_ble_evt->header.evt_id)
    {

        case BLE_GAP_EVT_CONNECTED:  //0 app 和 手表，已经连接  feng
            NRF_LOG_INFO("Connected.");
						guard_time_manger(true) ;
						app_connect();
						judg_app_flag = false;
 
				#if PM_BOND_SWITCH
						init_keyset();
				#endif
            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            APP_ERROR_CHECK(err_code);
						ble_work_status = 0x03 ;
						
            break;
        case BLE_GAP_EVT_DISCONNECTED: //1
            NRF_LOG_INFO("Disconnected.");
						app_disconnect();
						GUARD_TIME_SECONDS =  0 ;
						judg_app_flag = false ;
						// advertising_start(false);                                                  
            break;
				
        case BLE_GAP_EVT_CONN_PARAM_UPDATE: //2 
            break;				
        case BLE_GAP_EVT_SEC_PARAMS_REQUEST: //  feng 1
				{
					#if PM_BOND_SWITCH
					 NRF_LOG_INFO(" receive pair req."); 
					NRF_LOG_INFO(" step_counter:%d",++step_counter);
					init_sec();
					sd_ble_gap_sec_params_reply(m_conn_handle,BLE_GAP_SEC_STATUS_SUCCESS,&g_pair_params,&keyset);
					#endif
				}
            break;				
        case BLE_GAP_EVT_SEC_INFO_REQUEST: // 4 feng here
				{
					#if PM_BOND_SWITCH
					NRF_LOG_INFO(" step:%d",++step_counter );
					NRF_LOG_INFO("enc_need;%d  id_need:%d sign need:%d",
					p_ble_evt->evt.gap_evt.params.sec_info_request.enc_info,
					p_ble_evt->evt.gap_evt.params.sec_info_request.id_info,
					p_ble_evt->evt.gap_evt.params.sec_info_request.sign_info);
					
					NRF_LOG_INFO(" RSP: LTK: "  );
					for(int i=0;i<my_enc_key.enc_info.ltk_len;i++)
					{
							NRF_LOG_INFO("%x",my_enc_key.enc_info.ltk[i]); 
					}
					
					NRF_LOG_INFO("EDIV:%x RAMD",
					p_ble_evt->evt.gap_evt.params.sec_info_request.master_id.ediv); 
					
					for(int i=0;i<8;i++)
					{
							NRF_LOG_INFO("%x",
						p_ble_evt->evt.gap_evt.params.sec_info_request.master_id.rand[i]);
					}
					sd_ble_gap_sec_info_reply(m_conn_handle,&my_enc_key.enc_info,NULL,NULL);
				#endif
				}
            break;				
        case BLE_GAP_EVT_PASSKEY_DISPLAY: // 5 feng 2
				{
					#if PM_BOND_SWITCH
					NRF_LOG_INFO(" step:%d",++step_counter );
					NRF_LOG_INFO("  feng PASSKEY:"); 
					for(uint8_t i=0;i<6;i++)
					{
						NRF_LOG_INFO("%c",p_ble_evt->evt.gap_evt.params.passkey_display.passkey[i]);
															 
					}
					#endif
				}
            break; 
        case BLE_GAP_EVT_KEY_PRESSED: // 6
            break; 
        case BLE_GAP_EVT_LESC_DHKEY_REQUEST: // 7
            break; 
        case BLE_GAP_EVT_AUTH_STATUS: // 8			 here
				{
					#if PM_BOND_SWITCH
					NRF_LOG_INFO(" step:%d",++step_counter ); 
					NRF_LOG_INFO(" keyset dispatch done");  
					NRF_LOG_INFO("LTK"); 
					for(int i=0;i<my_enc_key.enc_info.ltk_len;i++)
					{
							NRF_LOG_INFO("%x",my_enc_key.enc_info.ltk[i]); 
					}
					  
					NRF_LOG_INFO("AUTH:%d",my_enc_key.enc_info.auth); 				
					NRF_LOG_INFO("LTK length:%d",my_enc_key.enc_info.ltk_len); 				
					NRF_LOG_INFO("EDIV:%x ",my_enc_key.master_id.ediv); 
					for(int i=0;i<8;i++)
					{
						NRF_LOG_INFO("%x",my_enc_key.master_id.rand[i]); 
					}
					#endif
				}
       
						
        case BLE_GAP_EVT_ADV_SET_TERMINATED: //16
        {
            NRF_LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GATTC_EVT_TIMEOUT: //3
            // Disconnect on GATT Client timeout event.
            NRF_LOG_DEBUG("GATT Client Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

 
        case BLE_GATTS_EVT_TIMEOUT: //5
            // Disconnect on GATT Server timeout event.
            NRF_LOG_DEBUG("GATT Server Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM. nrf_sdh_ble_default_cfg_set
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}

