duxinglang-1/nRF52810_test/JPR/examples/ble_peripheral/ble_app_template/main.c
/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event. 
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    pm_handler_on_pm_evt(p_evt); //配对绑定的提示信息
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
			
        case PM_EVT_BONDED_PEER_CONNECTED: //0
						NRF_LOG_INFO(" PM_EVT_BONDED_PEER_CONNECTED 0 \r\n");
					
            break;			
        case PM_EVT_CONN_SEC_START://1
						NRF_LOG_INFO(" PM_EVT_CONN_SEC_START 1 \r\n");
             
            break;						
        case PM_EVT_CONN_SEC_SUCCEEDED://2
             NRF_LOG_INFO(" PM_EVT_CONN_SEC_SUCCEEDED 2 \r\n");
 
            break;
        case PM_EVT_CONN_SEC_FAILED://3
             NRF_LOG_INFO(" PM_EVT_CONN_SEC_SUCCEEDED 3 \r\n");
             
            break;
        case PM_EVT_CONN_SEC_CONFIG_REQ://4
					{		
						//this case is optional. comment the following lines if not needed
						pm_conn_sec_config_t cfg;
						cfg.allow_repairing = true;   //true to permit a second paring with the same host when the bonding info is removed
						pm_conn_sec_config_reply(p_evt->conn_handle, &cfg);
 
					}
             
				
            break; 
				
        case PM_EVT_CONN_SEC_PARAMS_REQ://5
				 
             
            break; 
        case PM_EVT_STORAGE_FULL://6
             NRF_LOG_INFO(" PM_EVT_CONN_SEC_SUCCEEDED 6 \r\n");
             
            break;  
        case PM_EVT_ERROR_UNEXPECTED://7
             NRF_LOG_INFO(" PM_EVT_CONN_SEC_SUCCEEDED 7 \r\n");
             
            break;   
        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED://8
				{
             NRF_LOG_INFO(" PM_EVT_CONN_SEC_SUCCEEDED 8 \r\n");
					//配对绑定后，会输出该提示信息
				} 
            break; 
	    
        case PM_EVT_PEER_DATA_UPDATE_FAILED://9
             
             NRF_LOG_INFO(" PM_EVT_CONN_SEC_SUCCEEDED 9 \r\n");
            break;  
	    
        case PM_EVT_PEER_DELETE_SUCCEEDED://10
             for(uint8_t i=0;i<10;i++)
						 {
								NRF_LOG_INFO(" PM_EVT_CONN_SEC_SUCCEEDED 11 \r\n");
						 }
            break;  
	    
        case PM_EVT_PEER_DELETE_FAILED://11
             
             NRF_LOG_INFO(" PM_EVT_CONN_SEC_SUCCEEDED 12 \r\n");
            break;
		 
        case PM_EVT_PEERS_DELETE_SUCCEEDED: //12
            advertising_start(false);
            break; 
	    
        case PM_EVT_PEERS_DELETE_FAILED://13
             
             NRF_LOG_INFO(" PM_EVT_CONN_SEC_SUCCEEDED 13 \r\n");
            break;  
	    
        case PM_EVT_LOCAL_DB_CACHE_APPLIED://14
             
             NRF_LOG_INFO(" PM_EVT_CONN_SEC_SUCCEEDED 14 \r\n");
            break;  
	    
        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED://15
             
             NRF_LOG_INFO(" PM_EVT_CONN_SEC_SUCCEEDED 15 \r\n");
            break;  
	    
        case PM_EVT_SERVICE_CHANGED_IND_SENT://16
             
             NRF_LOG_INFO(" PM_EVT_CONN_SEC_SUCCEEDED 16 \r\n"); 
            break;  
	    
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED://17
             
             NRF_LOG_INFO(" PM_EVT_CONN_SEC_SUCCEEDED 17 \r\n");
            break;  
	    
        case PM_EVT_SLAVE_SECURITY_REQ://18
             
             NRF_LOG_INFO(" PM_EVT_CONN_SEC_SUCCEEDED 18 \r\n");
            break;  
	    
        case PM_EVT_FLASH_GARBAGE_COLLECTED://19
					
             NRF_LOG_INFO(" PM_EVT_CONN_SEC_SUCCEEDED 19 \r\n");
             
            break;  
	    
        case PM_EVT_FLASH_GARBAGE_COLLECTION_FAILED://20
             
             NRF_LOG_INFO(" PM_EVT_CONN_SEC_SUCCEEDED 20 \r\n");
            break;

        default:
            break;
    }
}


/**@brief Function for the Peer Manager initialization.
 */
static void peer_manager_init(void)
{
    ble_gap_sec_params_t sec_param;
    ret_code_t           err_code;

    err_code = pm_init();
    APP_ERROR_CHECK(err_code);

    memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

    // Security parameters to be used for all security procedures.
    sec_param.bond           = SEC_PARAM_BOND;
    sec_param.mitm           = SEC_PARAM_MITM; //
    sec_param.lesc           = SEC_PARAM_LESC;
    sec_param.keypress       = SEC_PARAM_KEYPRESS;
    sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
    sec_param.oob            = SEC_PARAM_OOB;
    sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
    sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
    sec_param.kdist_own.enc  = 1;
    sec_param.kdist_own.id   = 1;
    sec_param.kdist_peer.enc = 1;
    sec_param.kdist_peer.id  = 1;
		
 
    err_code = pm_sec_params_set(&sec_param);
    APP_ERROR_CHECK(err_code);

    err_code = pm_register(pm_evt_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated when button is pressed.
 */
static void bsp_event_handler(bsp_event_t event)
{
    ret_code_t err_code;

    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break; // BSP_EVENT_SLEEP

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break; // BSP_EVENT_DISCONNECT

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break; // BSP_EVENT_KEY_0

        default:
            break;
    }
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    ret_code_t             err_code;
    ble_advertising_init_t init;
		ble_advdata_manuf_data_t manuf_data;
		ble_gap_addr_t 					 device_addr;
	
 
		uint8_t m_adv_data[6];

