duxinglang-1/nRF52810_test/JPR/examples/ble_peripheral/ble_app_template/main.c
    memset(&init, 0, sizeof(init));
		memset(&m_adv_data, 0, sizeof(m_adv_data));
		
		err_code = sd_ble_gap_addr_get(&device_addr); 
		device_address[0]= device_addr.addr[5];
		device_address[1]= device_addr.addr[4];
		device_address[2]= device_addr.addr[3];
		device_address[3]= device_addr.addr[2];
		device_address[4]= device_addr.addr[1];
		device_address[5]= device_addr.addr[0];
		memcpy(m_adv_data,device_address,DEVICE_ADDRESS_LEN);
	
		manuf_data.data.p_data = m_adv_data;				//添加到 广播包中的数据
	  manuf_data.data.size = sizeof(m_adv_data);  //添加到 广播包中的数据长度
		manuf_data.company_identifier = 0x0001;			//2个字节，广播包从这个地方开始

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME; //BLE_ADVDATA_FULL_NAME BLE_ADVDATA_SHORT_NAME
    init.advdata.include_appearance      = false;//true
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
		
			
		init.advdata.p_manuf_specific_data= &manuf_data ; //add	    
		
		//init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    //init.advdata.uuids_complete.p_uuids  = m_adv_uuids;//不注释掉，广播名字不能显示完整

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}
/* 
ble_advertising_t * const p_advertising
advertising_stop(ble_advertising_t * const p_advertising)
m_advertising
*/
										 
void advertising_stop(ble_advertising_t * const p_advertising)
{
	sd_ble_gap_adv_stop(p_advertising->adv_handle);
	ble_work_status = 0x00 ;
}

/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
				advertising_stop(&m_advertising);
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED event
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
				ble_work_status = 0x02 ;
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' '\n' (hex 0x0A) or if the string has reached the maximum data length.
 BLE 从串口获取数据，然后通过ble 发送出去AB0007FF468000017888
*/
/**@snippet [Handling the data received over UART] */
uint32_t	counter=0;
void uart_event_handle(app_uart_evt_t * p_event)
{
	#if 1
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
		static	uint8_t index = 0;
		uint8_t	cr=0,i=0;
		uint16_t length=0; 
		uint16_t lens = 0;
		static uint16_t data_len=0; 
		uint8_t	rx_crc=0;
		uint8_t	rx_cmd_id_l=0;
		uint8_t	rx_cmd_id_h=0; 
		uint16_t	rx_cmd_id=0;
#endif
    switch (p_event->evt_type)
    {
        case APP_UART_DATA_READY:
						 
 #if 1				 
					 while (app_uart_get(&cr) == NRF_SUCCESS)
					 { 
						 data_array[index++] = cr;
////						 app_uart_put(cr)		;				 
						 NRF_LOG_INFO(" Rec_index:%d  cr:%x",index,cr);
					 }
							  
					 length =  (uint16_t)(index-1);
					
//						if(length == (256*data_array[1]+data_array[2]+3))
//						if((data_array[0] ==0xAB)&&(data_array[length] ==0x88))							
//						 {
//							for(i=0;i<length+1;i++)
//							{
//							  NRF_LOG_INFO("-52810 rece data :%x, data_len:%d", data_array[i], i);
//							}
//							 memset(data_array, 0, sizeof(data_array));
//							 length = 0;
//            }	

					#if 1			  
					 if((data_array[0] ==0xAB)&&(data_array[length] ==0x88))
					 {
			 
						data_len = ((data_array[1]<<8)|data_array[2]) ; //06
						rx_cmd_id_l=data_array[4]; 
						rx_cmd_id_h=data_array[3];  						 
						rx_cmd_id = (rx_cmd_id_h<<8|rx_cmd_id_l) ;
						 switch(rx_cmd_id)
						 {
							 case	0xFFB1:
							 {
								 
							 }break;
							 
							 case	0xFFB2://获取52810版本号
							 {
								  send_ble_version();
							 }break;
							 
							 case	0xFFB3://获取BLE MAC地址
							 {
								 send_ble_device_mac();
							 }break;
							 
							 case	0xFFB4://获取BLE当前工作状态	0:关闭 1:休眠 2:广播 3:连接
							 {
								 get_ble_work_stutes();
							 }break;
							 
							 case	0xFFB5://设置BLE工作模式		0:关闭 1:打开 2:唤醒 3:休眠
							 {
							
								 advertising_stop(&m_advertising);
								 advertising_start(false);	
							 }break;
							 
							 default:
								 break;
							 
						 }
 
						 if((rx_cmd_id !=0xFFB0)&&(rx_cmd_id !=0xFFB1)&&(rx_cmd_id !=0xFFB2)
							 &&(rx_cmd_id !=0xFFB3)&&(rx_cmd_id !=0xFFB4)&&(rx_cmd_id !=0xFFB5))
						 {
							 for(int8_t i=0;i<data_len+1;i++)
							 {
								rx_crc =  rx_crc + data_array[i] ;
							 }
							 if(rx_crc == data_array[length-1])
							 {
								 length = length+1 ;
								 NRF_LOG_INFO(" =========11over======length:%d ,counter: %d",length,counter++ );		
								 ble_nus_data_send(&m_nus, data_array, &length, m_conn_handle);
								 //nrf_delay_ms(1);
							 }
						}
	 				 
