duxinglang-1/nRF52810_test/JPR/examples/ble_peripheral/ble_app_template/main.c
						 index=0;  length = 0;
						 memset(data_array,0,sizeof(data_array));
					 }
				 #endif	
#endif      
            break;

        case APP_UART_DATA: 
					NRF_LOG_INFO(" ====== APP_UART_DATA ");		
            break;

        case APP_UART_TX_EMPTY:
					NRF_LOG_INFO(" ====== APP_UART_TX_EMPTY ");
            break;
 
        case APP_UART_FIFO_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
		
}
/**@snippet [Handling the data received over UART] */






/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    app_uart_comm_params_t const comm_params =
    {
        .rx_pin_no    = RX_PIN_NUMBER,
        .tx_pin_no    = TX_PIN_NUMBER,
        .rts_pin_no   = RTS_PIN_NUMBER,
        .cts_pin_no   = CTS_PIN_NUMBER,
        .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
        .use_parity   = false,
#if defined (UART_PRESENT)
        .baud_rate    = NRF_UART_BAUDRATE_115200
#else
        .baud_rate    = NRF_UARTE_BAUDRATE_115200
#endif
    };

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */

//static void tp_pin_handler(void)
static void tp_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{ 
	(void)pin;
	(void)action;
  IRQ_FLAG = 1;
}
void Read_Touch_Data_Interuputer_Processing(void)
{
	if(IRQ_FLAG)
	{
	  tp_interrupt_handler();
		
		IRQ_FLAG=0;
	}
}
void wdt_event_handler(void)
{
    //NOTE: The max amount of time we can spend in WDT interrupt is two cycles of 32768[Hz] clock - after that, reset occurs
}

/**@brief Function for application main entry.
 */
int main(void)
{
		bool erase_bonds;
		static  uint32_t  err_code ;

		// Initialize.
		log_init();//log打印初始化
		uart_init();
		fs_init();
		twi_init();//i2c
	
		bath_read();
    timers_init(); //软件定时器初始化
    buttons_leds_init(&erase_bonds); //按键LED灯初始化
    power_management_init();  //能量管理
    ble_stack_init();         //协议栈初始化
    gap_params_init();				//GAP初始化
    gatt_init();							//GATT初始化
    advertising_init();				//广播初始化
    services_init();					//服务初始化
    conn_params_init();				//连接参数更新初始化
    peer_manager_init();
		guard_time_init();
		nrf_gpio_cfg_output(UART_OUT_IRQ);
		nrf_gpio_pin_set(UART_OUT_IRQ);

		
    // Start execution.
    NRF_LOG_INFO("Template example started.");
    application_timers_start();

    advertising_start(false);	 
		err_code = nrf_drv_rng_init(NULL);
    APP_ERROR_CHECK(err_code);
		
		//Configure WDT.
	  nrf_drv_wdt_config_t config = NRF_DRV_WDT_DEAFULT_CONFIG;
    err_code = nrf_drv_wdt_init(&config, wdt_event_handler);
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_wdt_channel_alloc(&m_channel_id);
    APP_ERROR_CHECK(err_code);
    nrf_drv_wdt_enable();
	  
	
#if 1	
    nrf_gpio_cfg_output(TP_RSET_PIN);  //P10复位脚
		nrf_gpio_pin_clear(TP_RSET_PIN);   //
		nrf_delay_ms(10);
		nrf_gpio_pin_set(TP_RSET_PIN);
		nrf_delay_ms(50);	
		
		read_tp_id();
		
		nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_HITOLO(true);
		in_config.pull = NRF_GPIO_PIN_PULLUP;
		err_code = nrf_drv_gpiote_in_init(TP_EINT_PIN, &in_config, tp_pin_handler);
		APP_ERROR_CHECK(err_code);
		nrf_drv_gpiote_in_event_enable(TP_EINT_PIN, true);
#endif

    // Enter main loop.
//		 NRF_LOG_INFO(" system Initialization completed! \r\n");
		
//			Nrf52810_Uart_Send_Data_Test();
		
		for (;;)
		{
//			  Nrf52810_Uart_Send_Data_Test();
////				nrf_delay_ms(1);
//				idle_state_handle();	
#if 1
//			 Read_Touch_Data_Interuputer_Processing();
			idle_state_handle();
			nrf_drv_wdt_channel_feed(m_channel_id);

			if(connect_flag == true )//2 
			{  
				connect_flag  = false; 
				send_random_app();			
			}

			if(write_flag) //3 写
			{
				write_flag = false;
				updata_records();
			}

			if(find_whilt_flag)//1 find 0xFF58
			{
				find_whilt_flag = false;
				is_find_flag = add_whilt_list(test_buff);
				ack_find(is_find_flag); //没有找到 发送 随机数
			}
 #endif
		}
}
// 发送测试
void send_data(void)
{
	static	uint32_t error;
	uint16_t data_len = 32;
	uint8_t out[]={0x28, 0x86, 0x6A ,0x9D ,0x94 ,0xE8, 0x1C, 0x50  ,0x40, 0x61, 0x01, 0xBC, 0x1A, 0x22 ,0xD5, 0x04, 
									0x95 ,0xFE ,0xA3 ,0xD6 , 0x3D ,0x24 ,0xEE ,0xFC,  0x2E ,0x03 ,0xDC ,0xA3 ,0x3B ,0x95, 0xCF, 0xF1};
	error = ble_nus_data_send(&m_nus, out, &data_len, m_conn_handle);
	NRF_LOG_INFO(" feng feng feng :%x \r\n",error);
 
}

void send_data_app(uint8_t	*pbuff,uint16_t	pdata_len)
{
	static	uint32_t error;
 
 
	error = ble_nus_data_send(&m_nus, pbuff, &pdata_len, m_conn_handle);
	NRF_LOG_INFO(" Ble sned to app error:%x \r\n",error);
 
}

/**
 * @}
 */
